7767517
76 86
Input                    data                     0 1 data 0=224 1=224 2=3
Convolution              stage1_conv0_conv0_fwd   1 1 data stage1_conv0_relu0_fwd 0=32 1=3 3=2 4=1 5=1 6=864 8=2 9=1
ConvolutionDepthWise     stage1_sepconv0_conv0_fwd 1 1 stage1_conv0_relu0_fwd stage1_sepconv0_relu0_fwd 0=32 1=3 4=1 5=1 6=288 7=32 8=1 9=1
Convolution              stage1_sepconv0_conv1_fwd 1 1 stage1_sepconv0_relu0_fwd stage1_sepconv0_relu1_fwd 0=16 1=1 5=1 6=512 8=2 9=1
Convolution              stage2_expandedconv0_expand_conv0_fwd 1 1 stage1_sepconv0_relu1_fwd stage2_expandedconv0_expand_relu0_fwd 0=48 1=1 5=1 6=768 8=2 9=1
ConvolutionDepthWise     stage2_expandedconv0_dwise_conv0_fwd 1 1 stage2_expandedconv0_expand_relu0_fwd stage2_expandedconv0_dwise_relu0_fwd 0=48 1=3 3=2 4=1 5=1 6=432 7=48 8=1 9=1
Convolution              stage2_expandedconv0_linear_conv0_fwd 1 1 stage2_expandedconv0_dwise_relu0_fwd stage2_expandedconv0_linear_batchnorm0_fwd_stage2_expandedconv0_linear_batchnorm0_fwd_scale 0=24 1=1 5=1 6=1152 8=2
Split                    splitncnn_0              1 2 stage2_expandedconv0_linear_batchnorm0_fwd_stage2_expandedconv0_linear_batchnorm0_fwd_scale stage2_expandedconv0_linear_batchnorm0_fwd_stage2_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_0 stage2_expandedconv0_linear_batchnorm0_fwd_stage2_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_1
Convolution              stage2_expandedconv1_expand_conv0_fwd 1 1 stage2_expandedconv0_linear_batchnorm0_fwd_stage2_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_1 stage2_expandedconv1_expand_relu0_fwd 0=72 1=1 5=1 6=1728 8=2 9=1
ConvolutionDepthWise     stage2_expandedconv1_dwise_conv0_fwd 1 1 stage2_expandedconv1_expand_relu0_fwd stage2_expandedconv1_dwise_relu0_fwd 0=72 1=3 4=1 5=1 6=648 7=72 8=1 9=1
Convolution              stage2_expandedconv1_linear_conv0_fwd 1 1 stage2_expandedconv1_dwise_relu0_fwd stage2_expandedconv1_linear_batchnorm0_fwd_stage2_expandedconv1_linear_batchnorm0_fwd_scale 0=24 1=1 5=1 6=1728 8=2
Eltwise                  stage2_expandedconv1_elemwise_add0 2 1 stage2_expandedconv1_linear_batchnorm0_fwd_stage2_expandedconv1_linear_batchnorm0_fwd_scale stage2_expandedconv0_linear_batchnorm0_fwd_stage2_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_0 stage2_expandedconv1_elemwise_add0 0=1
Split                    splitncnn_1              1 2 stage2_expandedconv1_elemwise_add0 stage2_expandedconv1_elemwise_add0_splitncnn_0 stage2_expandedconv1_elemwise_add0_splitncnn_1
Convolution              stage2_expandedconv2_expand_conv0_fwd 1 1 stage2_expandedconv1_elemwise_add0_splitncnn_1 stage2_expandedconv2_expand_relu0_fwd 0=72 1=1 5=1 6=1728 8=2 9=1
ConvolutionDepthWise     stage2_expandedconv2_dwise_conv0_fwd 1 1 stage2_expandedconv2_expand_relu0_fwd stage2_expandedconv2_dwise_relu0_fwd 0=72 1=3 4=1 5=1 6=648 7=72 8=1 9=1
Convolution              stage2_expandedconv2_linear_conv0_fwd 1 1 stage2_expandedconv2_dwise_relu0_fwd stage2_expandedconv2_linear_batchnorm0_fwd_stage2_expandedconv2_linear_batchnorm0_fwd_scale 0=24 1=1 5=1 6=1728 8=2
Eltwise                  stage2_expandedconv2_elemwise_add0 2 1 stage2_expandedconv2_linear_batchnorm0_fwd_stage2_expandedconv2_linear_batchnorm0_fwd_scale stage2_expandedconv1_elemwise_add0_splitncnn_0 stage2_expandedconv2_elemwise_add0 0=1
Convolution              stage3_expandedconv0_expand_conv0_fwd 1 1 stage2_expandedconv2_elemwise_add0 stage3_expandedconv0_expand_relu0_fwd 0=72 1=1 5=1 6=1728 8=2 9=1
ConvolutionDepthWise     stage3_expandedconv0_dwise_conv0_fwd 1 1 stage3_expandedconv0_expand_relu0_fwd stage3_expandedconv0_dwise_relu0_fwd 0=72 1=5 3=2 4=2 5=1 6=1800 7=72 8=1 9=1
Convolution              stage3_expandedconv0_linear_conv0_fwd 1 1 stage3_expandedconv0_dwise_relu0_fwd stage3_expandedconv0_linear_batchnorm0_fwd_stage3_expandedconv0_linear_batchnorm0_fwd_scale 0=40 1=1 5=1 6=2880 8=2
Split                    splitncnn_2              1 2 stage3_expandedconv0_linear_batchnorm0_fwd_stage3_expandedconv0_linear_batchnorm0_fwd_scale stage3_expandedconv0_linear_batchnorm0_fwd_stage3_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_0 stage3_expandedconv0_linear_batchnorm0_fwd_stage3_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_1
Convolution              stage3_expandedconv1_expand_conv0_fwd 1 1 stage3_expandedconv0_linear_batchnorm0_fwd_stage3_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_1 stage3_expandedconv1_expand_relu0_fwd 0=120 1=1 5=1 6=4800 8=2 9=1
ConvolutionDepthWise     stage3_expandedconv1_dwise_conv0_fwd 1 1 stage3_expandedconv1_expand_relu0_fwd stage3_expandedconv1_dwise_relu0_fwd 0=120 1=3 4=1 5=1 6=1080 7=120 8=1 9=1
Convolution              stage3_expandedconv1_linear_conv0_fwd 1 1 stage3_expandedconv1_dwise_relu0_fwd stage3_expandedconv1_linear_batchnorm0_fwd_stage3_expandedconv1_linear_batchnorm0_fwd_scale 0=40 1=1 5=1 6=4800 8=2
Eltwise                  stage3_expandedconv1_elemwise_add0 2 1 stage3_expandedconv1_linear_batchnorm0_fwd_stage3_expandedconv1_linear_batchnorm0_fwd_scale stage3_expandedconv0_linear_batchnorm0_fwd_stage3_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_0 stage3_expandedconv1_elemwise_add0 0=1
Split                    splitncnn_3              1 2 stage3_expandedconv1_elemwise_add0 stage3_expandedconv1_elemwise_add0_splitncnn_0 stage3_expandedconv1_elemwise_add0_splitncnn_1
Convolution              stage3_expandedconv2_expand_conv0_fwd 1 1 stage3_expandedconv1_elemwise_add0_splitncnn_1 stage3_expandedconv2_expand_relu0_fwd 0=120 1=1 5=1 6=4800 8=2 9=1
ConvolutionDepthWise     stage3_expandedconv2_dwise_conv0_fwd 1 1 stage3_expandedconv2_expand_relu0_fwd stage3_expandedconv2_dwise_relu0_fwd 0=120 1=3 4=1 5=1 6=1080 7=120 8=1 9=1
Convolution              stage3_expandedconv2_linear_conv0_fwd 1 1 stage3_expandedconv2_dwise_relu0_fwd stage3_expandedconv2_linear_batchnorm0_fwd_stage3_expandedconv2_linear_batchnorm0_fwd_scale 0=40 1=1 5=1 6=4800 8=2
Eltwise                  stage3_expandedconv2_elemwise_add0 2 1 stage3_expandedconv2_linear_batchnorm0_fwd_stage3_expandedconv2_linear_batchnorm0_fwd_scale stage3_expandedconv1_elemwise_add0_splitncnn_0 stage3_expandedconv2_elemwise_add0 0=1
Convolution              stage4_1_expandedconv0_expand_conv0_fwd 1 1 stage3_expandedconv2_elemwise_add0 stage4_1_expandedconv0_expand_relu0_fwd 0=240 1=1 5=1 6=9600 8=2 9=1
ConvolutionDepthWise     stage4_1_expandedconv0_dwise_conv0_fwd 1 1 stage4_1_expandedconv0_expand_relu0_fwd stage4_1_expandedconv0_dwise_relu0_fwd 0=240 1=5 3=2 4=2 5=1 6=6000 7=240 8=1 9=1
Convolution              stage4_1_expandedconv0_linear_conv0_fwd 1 1 stage4_1_expandedconv0_dwise_relu0_fwd stage4_1_expandedconv0_linear_batchnorm0_fwd_stage4_1_expandedconv0_linear_batchnorm0_fwd_scale 0=80 1=1 5=1 6=19200 8=2
Split                    splitncnn_4              1 2 stage4_1_expandedconv0_linear_batchnorm0_fwd_stage4_1_expandedconv0_linear_batchnorm0_fwd_scale stage4_1_expandedconv0_linear_batchnorm0_fwd_stage4_1_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_0 stage4_1_expandedconv0_linear_batchnorm0_fwd_stage4_1_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_1
Convolution              stage4_1_expandedconv1_expand_conv0_fwd 1 1 stage4_1_expandedconv0_linear_batchnorm0_fwd_stage4_1_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_1 stage4_1_expandedconv1_expand_relu0_fwd 0=480 1=1 5=1 6=38400 8=2 9=1
ConvolutionDepthWise     stage4_1_expandedconv1_dwise_conv0_fwd 1 1 stage4_1_expandedconv1_expand_relu0_fwd stage4_1_expandedconv1_dwise_relu0_fwd 0=480 1=3 4=1 5=1 6=4320 7=480 8=1 9=1
Convolution              stage4_1_expandedconv1_linear_conv0_fwd 1 1 stage4_1_expandedconv1_dwise_relu0_fwd stage4_1_expandedconv1_linear_batchnorm0_fwd_stage4_1_expandedconv1_linear_batchnorm0_fwd_scale 0=80 1=1 5=1 6=38400 8=2
Eltwise                  stage4_1_expandedconv1_elemwise_add0 2 1 stage4_1_expandedconv1_linear_batchnorm0_fwd_stage4_1_expandedconv1_linear_batchnorm0_fwd_scale stage4_1_expandedconv0_linear_batchnorm0_fwd_stage4_1_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_0 stage4_1_expandedconv1_elemwise_add0 0=1
Split                    splitncnn_5              1 2 stage4_1_expandedconv1_elemwise_add0 stage4_1_expandedconv1_elemwise_add0_splitncnn_0 stage4_1_expandedconv1_elemwise_add0_splitncnn_1
Convolution              stage4_1_expandedconv2_expand_conv0_fwd 1 1 stage4_1_expandedconv1_elemwise_add0_splitncnn_1 stage4_1_expandedconv2_expand_relu0_fwd 0=480 1=1 5=1 6=38400 8=2 9=1
ConvolutionDepthWise     stage4_1_expandedconv2_dwise_conv0_fwd 1 1 stage4_1_expandedconv2_expand_relu0_fwd stage4_1_expandedconv2_dwise_relu0_fwd 0=480 1=3 4=1 5=1 6=4320 7=480 8=1 9=1
Convolution              stage4_1_expandedconv2_linear_conv0_fwd 1 1 stage4_1_expandedconv2_dwise_relu0_fwd stage4_1_expandedconv2_linear_batchnorm0_fwd_stage4_1_expandedconv2_linear_batchnorm0_fwd_scale 0=80 1=1 5=1 6=38400 8=2
Eltwise                  stage4_1_expandedconv2_elemwise_add0 2 1 stage4_1_expandedconv2_linear_batchnorm0_fwd_stage4_1_expandedconv2_linear_batchnorm0_fwd_scale stage4_1_expandedconv1_elemwise_add0_splitncnn_0 stage4_1_expandedconv2_elemwise_add0 0=1
Convolution              stage4_2_expandedconv0_expand_conv0_fwd 1 1 stage4_1_expandedconv2_elemwise_add0 stage4_2_expandedconv0_expand_relu0_fwd 0=480 1=1 5=1 6=38400 8=2 9=1
ConvolutionDepthWise     stage4_2_expandedconv0_dwise_conv0_fwd 1 1 stage4_2_expandedconv0_expand_relu0_fwd stage4_2_expandedconv0_dwise_relu0_fwd 0=480 1=3 4=1 5=1 6=4320 7=480 8=1 9=1
Convolution              stage4_2_expandedconv0_linear_conv0_fwd 1 1 stage4_2_expandedconv0_dwise_relu0_fwd stage4_2_expandedconv0_linear_batchnorm0_fwd_stage4_2_expandedconv0_linear_batchnorm0_fwd_scale 0=96 1=1 5=1 6=46080 8=2
Split                    splitncnn_6              1 2 stage4_2_expandedconv0_linear_batchnorm0_fwd_stage4_2_expandedconv0_linear_batchnorm0_fwd_scale stage4_2_expandedconv0_linear_batchnorm0_fwd_stage4_2_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_0 stage4_2_expandedconv0_linear_batchnorm0_fwd_stage4_2_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_1
Convolution              stage4_2_expandedconv1_expand_conv0_fwd 1 1 stage4_2_expandedconv0_linear_batchnorm0_fwd_stage4_2_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_1 stage4_2_expandedconv1_expand_relu0_fwd 0=576 1=1 5=1 6=55296 8=2 9=1
ConvolutionDepthWise     stage4_2_expandedconv1_dwise_conv0_fwd 1 1 stage4_2_expandedconv1_expand_relu0_fwd stage4_2_expandedconv1_dwise_relu0_fwd 0=576 1=3 4=1 5=1 6=5184 7=576 8=1 9=1
Convolution              stage4_2_expandedconv1_linear_conv0_fwd 1 1 stage4_2_expandedconv1_dwise_relu0_fwd stage4_2_expandedconv1_linear_batchnorm0_fwd_stage4_2_expandedconv1_linear_batchnorm0_fwd_scale 0=96 1=1 5=1 6=55296 8=2
Eltwise                  stage4_2_expandedconv1_elemwise_add0 2 1 stage4_2_expandedconv1_linear_batchnorm0_fwd_stage4_2_expandedconv1_linear_batchnorm0_fwd_scale stage4_2_expandedconv0_linear_batchnorm0_fwd_stage4_2_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_0 stage4_2_expandedconv1_elemwise_add0 0=1
Convolution              stage5_1_expandedconv0_expand_conv0_fwd 1 1 stage4_2_expandedconv1_elemwise_add0 stage5_1_expandedconv0_expand_relu0_fwd 0=576 1=1 5=1 6=55296 8=2 9=1
ConvolutionDepthWise     stage5_1_expandedconv0_dwise_conv0_fwd 1 1 stage5_1_expandedconv0_expand_relu0_fwd stage5_1_expandedconv0_dwise_relu0_fwd 0=576 1=5 3=2 4=2 5=1 6=14400 7=576 8=1 9=1
Convolution              stage5_1_expandedconv0_linear_conv0_fwd 1 1 stage5_1_expandedconv0_dwise_relu0_fwd stage5_1_expandedconv0_linear_batchnorm0_fwd_stage5_1_expandedconv0_linear_batchnorm0_fwd_scale 0=192 1=1 5=1 6=110592 8=2
Split                    splitncnn_7              1 2 stage5_1_expandedconv0_linear_batchnorm0_fwd_stage5_1_expandedconv0_linear_batchnorm0_fwd_scale stage5_1_expandedconv0_linear_batchnorm0_fwd_stage5_1_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_0 stage5_1_expandedconv0_linear_batchnorm0_fwd_stage5_1_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_1
Convolution              stage5_1_expandedconv1_expand_conv0_fwd 1 1 stage5_1_expandedconv0_linear_batchnorm0_fwd_stage5_1_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_1 stage5_1_expandedconv1_expand_relu0_fwd 0=1152 1=1 5=1 6=221184 8=2 9=1
ConvolutionDepthWise     stage5_1_expandedconv1_dwise_conv0_fwd 1 1 stage5_1_expandedconv1_expand_relu0_fwd stage5_1_expandedconv1_dwise_relu0_fwd 0=1152 1=3 4=1 5=1 6=10368 7=1152 8=1 9=1
Convolution              stage5_1_expandedconv1_linear_conv0_fwd 1 1 stage5_1_expandedconv1_dwise_relu0_fwd stage5_1_expandedconv1_linear_batchnorm0_fwd_stage5_1_expandedconv1_linear_batchnorm0_fwd_scale 0=192 1=1 5=1 6=221184 8=2
Eltwise                  stage5_1_expandedconv1_elemwise_add0 2 1 stage5_1_expandedconv1_linear_batchnorm0_fwd_stage5_1_expandedconv1_linear_batchnorm0_fwd_scale stage5_1_expandedconv0_linear_batchnorm0_fwd_stage5_1_expandedconv0_linear_batchnorm0_fwd_scale_splitncnn_0 stage5_1_expandedconv1_elemwise_add0 0=1
Split                    splitncnn_8              1 2 stage5_1_expandedconv1_elemwise_add0 stage5_1_expandedconv1_elemwise_add0_splitncnn_0 stage5_1_expandedconv1_elemwise_add0_splitncnn_1
Convolution              stage5_1_expandedconv2_expand_conv0_fwd 1 1 stage5_1_expandedconv1_elemwise_add0_splitncnn_1 stage5_1_expandedconv2_expand_relu0_fwd 0=1152 1=1 5=1 6=221184 8=2 9=1
ConvolutionDepthWise     stage5_1_expandedconv2_dwise_conv0_fwd 1 1 stage5_1_expandedconv2_expand_relu0_fwd stage5_1_expandedconv2_dwise_relu0_fwd 0=1152 1=3 4=1 5=1 6=10368 7=1152 8=1 9=1
Convolution              stage5_1_expandedconv2_linear_conv0_fwd 1 1 stage5_1_expandedconv2_dwise_relu0_fwd stage5_1_expandedconv2_linear_batchnorm0_fwd_stage5_1_expandedconv2_linear_batchnorm0_fwd_scale 0=192 1=1 5=1 6=221184 8=2
Eltwise                  stage5_1_expandedconv2_elemwise_add0 2 1 stage5_1_expandedconv2_linear_batchnorm0_fwd_stage5_1_expandedconv2_linear_batchnorm0_fwd_scale stage5_1_expandedconv1_elemwise_add0_splitncnn_0 stage5_1_expandedconv2_elemwise_add0 0=1
Split                    splitncnn_9              1 2 stage5_1_expandedconv2_elemwise_add0 stage5_1_expandedconv2_elemwise_add0_splitncnn_0 stage5_1_expandedconv2_elemwise_add0_splitncnn_1
Convolution              stage5_1_expandedconv3_expand_conv0_fwd 1 1 stage5_1_expandedconv2_elemwise_add0_splitncnn_1 stage5_1_expandedconv3_expand_relu0_fwd 0=1152 1=1 5=1 6=221184 8=2 9=1
ConvolutionDepthWise     stage5_1_expandedconv3_dwise_conv0_fwd 1 1 stage5_1_expandedconv3_expand_relu0_fwd stage5_1_expandedconv3_dwise_relu0_fwd 0=1152 1=3 4=1 5=1 6=10368 7=1152 8=1 9=1
Convolution              stage5_1_expandedconv3_linear_conv0_fwd 1 1 stage5_1_expandedconv3_dwise_relu0_fwd stage5_1_expandedconv3_linear_batchnorm0_fwd_stage5_1_expandedconv3_linear_batchnorm0_fwd_scale 0=192 1=1 5=1 6=221184 8=2
Eltwise                  stage5_1_expandedconv3_elemwise_add0 2 1 stage5_1_expandedconv3_linear_batchnorm0_fwd_stage5_1_expandedconv3_linear_batchnorm0_fwd_scale stage5_1_expandedconv2_elemwise_add0_splitncnn_0 stage5_1_expandedconv3_elemwise_add0 0=1
Convolution              stage5_2_expandedconv0_expand_conv0_fwd 1 1 stage5_1_expandedconv3_elemwise_add0 stage5_2_expandedconv0_expand_relu0_fwd 0=1152 1=1 5=1 6=221184 8=2 9=1
ConvolutionDepthWise     stage5_2_expandedconv0_dwise_conv0_fwd 1 1 stage5_2_expandedconv0_expand_relu0_fwd stage5_2_expandedconv0_dwise_relu0_fwd 0=1152 1=3 4=1 5=1 6=10368 7=1152 8=1 9=1
Convolution              stage5_2_expandedconv0_linear_conv0_fwd 1 1 stage5_2_expandedconv0_dwise_relu0_fwd stage5_2_expandedconv0_linear_batchnorm0_fwd_stage5_2_expandedconv0_linear_batchnorm0_fwd_scale 0=320 1=1 5=1 6=368640 8=2
Convolution              stage5_3_conv0_fwd       1 1 stage5_2_expandedconv0_linear_batchnorm0_fwd_stage5_2_expandedconv0_linear_batchnorm0_fwd_scale stage5_3_relu0_fwd 0=1280 1=1 5=1 6=409600 8=2 9=1
Pooling                  pool0_fwd                1 1 stage5_3_relu0_fwd pool0_fwd 0=1 4=1
InnerProduct             dense0_fwd               1 1 pool0_fwd dense0_fwd 0=1000 1=1 2=1280000 8=2
Softmax                  pred                     1 1 dense0_fwd output
