7767517
137 172
Input                    input                    0 1 data 0=395 1=395 2=3
Convolution              conv1_3x3_s2             1 1 data conv1_3x3_s2_conv1_3x3_relu 0=32 1=3 3=2 5=1 6=864 9=1
Convolution              conv2_3x3_s1             1 1 conv1_3x3_s2_conv1_3x3_relu conv2_3x3_s1_conv2_3x3_relu 0=32 1=3 5=1 6=9216 9=1
Convolution              conv3_3x3_s1             1 1 conv2_3x3_s1_conv2_3x3_relu conv3_3x3_s1_conv3_3x3_relu 0=64 1=3 4=1 5=1 6=18432 9=1
Pooling                  pool1_3x3_s2             1 1 conv3_3x3_s1_conv3_3x3_relu pool1_3x3_s2 1=3 2=2
Convolution              conv4_3x3_reduce         1 1 pool1_3x3_s2 conv4_3x3_reduce_conv4_relu_3x3_reduce 0=80 1=1 5=1 6=5120 9=1
Convolution              conv4_3x3                1 1 conv4_3x3_reduce_conv4_relu_3x3_reduce conv4_3x3_conv4_relu_3x3 0=192 1=3 5=1 6=138240 9=1
Pooling                  pool2_3x3_s2             1 1 conv4_3x3_conv4_relu_3x3 pool2_3x3_s2 1=3 2=2
Split                    splitncnn_0              1 4 pool2_3x3_s2 pool2_3x3_s2_splitncnn_0 pool2_3x3_s2_splitncnn_1 pool2_3x3_s2_splitncnn_2 pool2_3x3_s2_splitncnn_3
Convolution              inception_a1_1x1         1 1 pool2_3x3_s2_splitncnn_3 inception_a1_1x1_inception_a1_1x1_relu 0=64 1=1 5=1 6=12288 9=1
Convolution              inception_a1_5x5_reduce  1 1 pool2_3x3_s2_splitncnn_2 inception_a1_5x5_reduce_inception_a1_5x5_reduce_relu 0=48 1=1 5=1 6=9216 9=1
Convolution              inception_a1_5x5         1 1 inception_a1_5x5_reduce_inception_a1_5x5_reduce_relu inception_a1_5x5_inception_a1_5x5_relu 0=64 1=5 4=2 5=1 6=76800 9=1
Convolution              inception_a1_3x3_reduce  1 1 pool2_3x3_s2_splitncnn_1 inception_a1_3x3_reduce_inception_a1_3x3_reduce_relu 0=64 1=1 5=1 6=12288 9=1
Convolution              inception_a1_3x3_1       1 1 inception_a1_3x3_reduce_inception_a1_3x3_reduce_relu inception_a1_3x3_1_inception_a1_3x3_1_relu 0=96 1=3 4=1 5=1 6=55296 9=1
Convolution              inception_a1_3x3_2       1 1 inception_a1_3x3_1_inception_a1_3x3_1_relu inception_a1_3x3_2_inception_a1_3x3_2_relu 0=96 1=3 4=1 5=1 6=82944 9=1
Pooling                  inception_a1_pool        1 1 pool2_3x3_s2_splitncnn_0 inception_a1_pool 0=1 1=3 3=1
Convolution              inception_a1_pool_proj   1 1 inception_a1_pool inception_a1_pool_proj_inception_a1_pool_proj_relu 0=32 1=1 5=1 6=6144 9=1
Concat                   inception_a1_output      4 1 inception_a1_1x1_inception_a1_1x1_relu inception_a1_5x5_inception_a1_5x5_relu inception_a1_3x3_2_inception_a1_3x3_2_relu inception_a1_pool_proj_inception_a1_pool_proj_relu inception_a1_output
Split                    splitncnn_1              1 4 inception_a1_output inception_a1_output_splitncnn_0 inception_a1_output_splitncnn_1 inception_a1_output_splitncnn_2 inception_a1_output_splitncnn_3
Convolution              inception_a2_1x1         1 1 inception_a1_output_splitncnn_3 inception_a2_1x1_inception_a2_1x1_relu 0=64 1=1 5=1 6=16384 9=1
Convolution              inception_a2_5x5_reduce  1 1 inception_a1_output_splitncnn_2 inception_a2_5x5_reduce_inception_a2_5x5_reduce_relu 0=48 1=1 5=1 6=12288 9=1
Convolution              inception_a2_5x5         1 1 inception_a2_5x5_reduce_inception_a2_5x5_reduce_relu inception_a2_5x5_inception_a2_5x5_relu 0=64 1=5 4=2 5=1 6=76800 9=1
Convolution              inception_a2_3x3_reduce  1 1 inception_a1_output_splitncnn_1 inception_a2_3x3_reduce_inception_a2_3x3_reduce_relu 0=64 1=1 5=1 6=16384 9=1
Convolution              inception_a2_3x3_1       1 1 inception_a2_3x3_reduce_inception_a2_3x3_reduce_relu inception_a2_3x3_1_inception_a2_3x3_1_relu 0=96 1=3 4=1 5=1 6=55296 9=1
Convolution              inception_a2_3x3_2       1 1 inception_a2_3x3_1_inception_a2_3x3_1_relu inception_a2_3x3_2_inception_a2_3x3_2_relu 0=96 1=3 4=1 5=1 6=82944 9=1
Pooling                  inception_a2_pool        1 1 inception_a1_output_splitncnn_0 inception_a2_pool 0=1 1=3 3=1
Convolution              inception_a2_pool_proj   1 1 inception_a2_pool inception_a2_pool_proj_inception_a2_pool_proj_relu 0=64 1=1 5=1 6=16384 9=1
Concat                   inception_a2_output      4 1 inception_a2_1x1_inception_a2_1x1_relu inception_a2_5x5_inception_a2_5x5_relu inception_a2_3x3_2_inception_a2_3x3_2_relu inception_a2_pool_proj_inception_a2_pool_proj_relu inception_a2_output
Split                    splitncnn_2              1 4 inception_a2_output inception_a2_output_splitncnn_0 inception_a2_output_splitncnn_1 inception_a2_output_splitncnn_2 inception_a2_output_splitncnn_3
Convolution              inception_a3_1x1         1 1 inception_a2_output_splitncnn_3 inception_a3_1x1_inception_a3_1x1_relu 0=64 1=1 5=1 6=18432 9=1
Convolution              inception_a3_5x5_reduce  1 1 inception_a2_output_splitncnn_2 inception_a3_5x5_reduce_inception_a3_5x5_reduce_relu 0=48 1=1 5=1 6=13824 9=1
Convolution              inception_a3_5x5         1 1 inception_a3_5x5_reduce_inception_a3_5x5_reduce_relu inception_a3_5x5_inception_a3_5x5_relu 0=64 1=5 4=2 5=1 6=76800 9=1
Convolution              inception_a3_3x3_reduce  1 1 inception_a2_output_splitncnn_1 inception_a3_3x3_reduce_inception_a3_3x3_reduce_relu 0=64 1=1 5=1 6=18432 9=1
Convolution              inception_a3_3x3_1       1 1 inception_a3_3x3_reduce_inception_a3_3x3_reduce_relu inception_a3_3x3_1_inception_a3_3x3_1_relu 0=96 1=3 4=1 5=1 6=55296 9=1
Convolution              inception_a3_3x3_2       1 1 inception_a3_3x3_1_inception_a3_3x3_1_relu inception_a3_3x3_2_inception_a3_3x3_2_relu 0=96 1=3 4=1 5=1 6=82944 9=1
Pooling                  inception_a3_pool        1 1 inception_a2_output_splitncnn_0 inception_a3_pool 0=1 1=3 3=1
Convolution              inception_a3_pool_proj   1 1 inception_a3_pool inception_a3_pool_proj_inception_a3_pool_proj_relu 0=64 1=1 5=1 6=18432 9=1
Concat                   inception_a3_output      4 1 inception_a3_1x1_inception_a3_1x1_relu inception_a3_5x5_inception_a3_5x5_relu inception_a3_3x3_2_inception_a3_3x3_2_relu inception_a3_pool_proj_inception_a3_pool_proj_relu inception_a3_output
Split                    splitncnn_3              1 3 inception_a3_output inception_a3_output_splitncnn_0 inception_a3_output_splitncnn_1 inception_a3_output_splitncnn_2
Convolution              reduction_a_3x3          1 1 inception_a3_output_splitncnn_2 reduction_a_3x3_reduction_a_3x3_relu 0=384 1=3 3=2 5=1 6=995328 9=1
Convolution              reduction_a_3x3_2_reduce 1 1 inception_a3_output_splitncnn_1 reduction_a_3x3_2_reduce_reduction_a_3x3_2_reduce_relu 0=64 1=1 5=1 6=18432 9=1
Convolution              reduction_a_3x3_2        1 1 reduction_a_3x3_2_reduce_reduction_a_3x3_2_reduce_relu reduction_a_3x3_2_reduction_a_3x3_2_relu 0=96 1=3 4=1 5=1 6=55296 9=1
Convolution              reduction_a_3x3_3        1 1 reduction_a_3x3_2_reduction_a_3x3_2_relu reduction_a_3x3_3_reduction_a_3x3_3_relu 0=96 1=3 3=2 5=1 6=82944 9=1
Pooling                  reduction_a_pool         1 1 inception_a3_output_splitncnn_0 reduction_a_pool 1=3 2=2
Concat                   reduction_a_concat       3 1 reduction_a_3x3_reduction_a_3x3_relu reduction_a_3x3_3_reduction_a_3x3_3_relu reduction_a_pool reduction_a_concat
Split                    splitncnn_4              1 4 reduction_a_concat reduction_a_concat_splitncnn_0 reduction_a_concat_splitncnn_1 reduction_a_concat_splitncnn_2 reduction_a_concat_splitncnn_3
Convolution              inception_b1_1x1_2       1 1 reduction_a_concat_splitncnn_3 inception_b1_1x1_2_inception_b1_1x1_2_relu 0=192 1=1 5=1 6=147456 9=1
Convolution              inception_b1_1x7_reduce  1 1 reduction_a_concat_splitncnn_2 inception_b1_1x7_reduce_inception_b1_1x7_reduce_relu 0=128 1=1 5=1 6=98304 9=1
Convolution              inception_b1_1x7         1 1 inception_b1_1x7_reduce_inception_b1_1x7_reduce_relu inception_b1_1x7_inception_b1_1x7_relu 0=128 1=7 11=1 4=3 14=0 5=1 6=114688 9=1
Convolution              inception_b1_7x1         1 1 inception_b1_1x7_inception_b1_1x7_relu inception_b1_7x1_inception_b1_7x1_relu 0=192 1=1 11=7 14=3 5=1 6=172032 9=1
Convolution              inception_b1_7x1_reduce  1 1 reduction_a_concat_splitncnn_1 inception_b1_7x1_reduce_inception_b1_7x1_reduce_relu 0=128 1=1 5=1 6=98304 9=1
Convolution              inception_b1_7x1_2       1 1 inception_b1_7x1_reduce_inception_b1_7x1_reduce_relu inception_b1_7x1_2_inception_b1_7x1_2_relu 0=128 1=1 11=7 14=3 5=1 6=114688 9=1
Convolution              inception_b1_1x7_2       1 1 inception_b1_7x1_2_inception_b1_7x1_2_relu inception_b1_1x7_2_inception_b1_1x7_2_relu 0=128 1=7 11=1 4=3 14=0 5=1 6=114688 9=1
Convolution              inception_b1_7x1_3       1 1 inception_b1_1x7_2_inception_b1_1x7_2_relu inception_b1_7x1_3_inception_b1_7x1_3_relu 0=128 1=1 11=7 14=3 5=1 6=114688 9=1
Convolution              inception_b1_1x7_3       1 1 inception_b1_7x1_3_inception_b1_7x1_3_relu inception_b1_1x7_3_inception_b1_1x7_3_relu 0=192 1=7 11=1 4=3 14=0 5=1 6=172032 9=1
Pooling                  inception_b1_pool_ave    1 1 reduction_a_concat_splitncnn_0 inception_b1_pool_ave 0=1 1=3 3=1
Convolution              inception_b1_1x1         1 1 inception_b1_pool_ave inception_b1_1x1_inception_b1_1x1_relu 0=192 1=1 5=1 6=147456 9=1
Concat                   inception_b1_concat      4 1 inception_b1_1x1_2_inception_b1_1x1_2_relu inception_b1_7x1_inception_b1_7x1_relu inception_b1_1x7_3_inception_b1_1x7_3_relu inception_b1_1x1_inception_b1_1x1_relu inception_b1_concat
Split                    splitncnn_5              1 4 inception_b1_concat inception_b1_concat_splitncnn_0 inception_b1_concat_splitncnn_1 inception_b1_concat_splitncnn_2 inception_b1_concat_splitncnn_3
Convolution              inception_b2_1x1_2       1 1 inception_b1_concat_splitncnn_3 inception_b2_1x1_2_inception_b2_1x1_2_relu 0=192 1=1 5=1 6=147456 9=1
Convolution              inception_b2_1x7_reduce  1 1 inception_b1_concat_splitncnn_2 inception_b2_1x7_reduce_inception_b2_1x7_reduce_relu 0=160 1=1 5=1 6=122880 9=1
Convolution              inception_b2_1x7         1 1 inception_b2_1x7_reduce_inception_b2_1x7_reduce_relu inception_b2_1x7_inception_b2_1x7_relu 0=160 1=7 11=1 4=3 14=0 5=1 6=179200 9=1
Convolution              inception_b2_7x1         1 1 inception_b2_1x7_inception_b2_1x7_relu inception_b2_7x1_inception_b2_7x1_relu 0=192 1=1 11=7 14=3 5=1 6=215040 9=1
Convolution              inception_b2_7x1_reduce  1 1 inception_b1_concat_splitncnn_1 inception_b2_7x1_reduce_inception_b2_7x1_reduce_relu 0=160 1=1 5=1 6=122880 9=1
Convolution              inception_b2_7x1_2       1 1 inception_b2_7x1_reduce_inception_b2_7x1_reduce_relu inception_b2_7x1_2_inception_b2_7x1_2_relu 0=160 1=1 11=7 14=3 5=1 6=179200 9=1
Convolution              inception_b2_1x7_2       1 1 inception_b2_7x1_2_inception_b2_7x1_2_relu inception_b2_1x7_2_inception_b2_1x7_2_relu 0=160 1=7 11=1 4=3 14=0 5=1 6=179200 9=1
Convolution              inception_b2_7x1_3       1 1 inception_b2_1x7_2_inception_b2_1x7_2_relu inception_b2_7x1_3_inception_b2_7x1_3_relu 0=160 1=1 11=7 14=3 5=1 6=179200 9=1
Convolution              inception_b2_1x7_3       1 1 inception_b2_7x1_3_inception_b2_7x1_3_relu inception_b2_1x7_3_inception_b2_1x7_3_relu 0=192 1=7 11=1 4=3 14=0 5=1 6=215040 9=1
Pooling                  inception_b2_pool_ave    1 1 inception_b1_concat_splitncnn_0 inception_b2_pool_ave 0=1 1=3 3=1
Convolution              inception_b2_1x1         1 1 inception_b2_pool_ave inception_b2_1x1_inception_b2_1x1_relu 0=192 1=1 5=1 6=147456 9=1
Concat                   inception_b2_concat      4 1 inception_b2_1x1_2_inception_b2_1x1_2_relu inception_b2_7x1_inception_b2_7x1_relu inception_b2_1x7_3_inception_b2_1x7_3_relu inception_b2_1x1_inception_b2_1x1_relu inception_b2_concat
Split                    splitncnn_6              1 4 inception_b2_concat inception_b2_concat_splitncnn_0 inception_b2_concat_splitncnn_1 inception_b2_concat_splitncnn_2 inception_b2_concat_splitncnn_3
Convolution              inception_b3_1x1_2       1 1 inception_b2_concat_splitncnn_3 inception_b3_1x1_2_inception_b3_1x1_2_relu 0=192 1=1 5=1 6=147456 9=1
Convolution              inception_b3_1x7_reduce  1 1 inception_b2_concat_splitncnn_2 inception_b3_1x7_reduce_inception_b3_1x7_reduce_relu 0=160 1=1 5=1 6=122880 9=1
Convolution              inception_b3_1x7         1 1 inception_b3_1x7_reduce_inception_b3_1x7_reduce_relu inception_b3_1x7_inception_b3_1x7_relu 0=160 1=7 11=1 4=3 14=0 5=1 6=179200 9=1
Convolution              inception_b3_7x1         1 1 inception_b3_1x7_inception_b3_1x7_relu inception_b3_7x1_inception_b3_7x1_relu 0=192 1=1 11=7 14=3 5=1 6=215040 9=1
Convolution              inception_b3_7x1_reduce  1 1 inception_b2_concat_splitncnn_1 inception_b3_7x1_reduce_inception_b3_7x1_reduce_relu 0=160 1=1 5=1 6=122880 9=1
Convolution              inception_b3_7x1_2       1 1 inception_b3_7x1_reduce_inception_b3_7x1_reduce_relu inception_b3_7x1_2_inception_b3_7x1_2_relu 0=160 1=1 11=7 14=3 5=1 6=179200 9=1
Convolution              inception_b3_1x7_2       1 1 inception_b3_7x1_2_inception_b3_7x1_2_relu inception_b3_1x7_2_inception_b3_1x7_2_relu 0=160 1=7 11=1 4=3 14=0 5=1 6=179200 9=1
Convolution              inception_b3_7x1_3       1 1 inception_b3_1x7_2_inception_b3_1x7_2_relu inception_b3_7x1_3_inception_b3_7x1_3_relu 0=160 1=1 11=7 14=3 5=1 6=179200 9=1
Convolution              inception_b3_1x7_3       1 1 inception_b3_7x1_3_inception_b3_7x1_3_relu inception_b3_1x7_3_inception_b3_1x7_3_relu 0=192 1=7 11=1 4=3 14=0 5=1 6=215040 9=1
Pooling                  inception_b3_pool_ave    1 1 inception_b2_concat_splitncnn_0 inception_b3_pool_ave 0=1 1=3 3=1
Convolution              inception_b3_1x1         1 1 inception_b3_pool_ave inception_b3_1x1_inception_b3_1x1_relu 0=192 1=1 5=1 6=147456 9=1
Concat                   inception_b3_concat      4 1 inception_b3_1x1_2_inception_b3_1x1_2_relu inception_b3_7x1_inception_b3_7x1_relu inception_b3_1x7_3_inception_b3_1x7_3_relu inception_b3_1x1_inception_b3_1x1_relu inception_b3_concat
Split                    splitncnn_7              1 4 inception_b3_concat inception_b3_concat_splitncnn_0 inception_b3_concat_splitncnn_1 inception_b3_concat_splitncnn_2 inception_b3_concat_splitncnn_3
Convolution              inception_b4_1x1_2       1 1 inception_b3_concat_splitncnn_3 inception_b4_1x1_2_inception_b4_1x1_2_relu 0=192 1=1 5=1 6=147456 9=1
Convolution              inception_b4_1x7_reduce  1 1 inception_b3_concat_splitncnn_2 inception_b4_1x7_reduce_inception_b4_1x7_reduce_relu 0=192 1=1 5=1 6=147456 9=1
Convolution              inception_b4_1x7         1 1 inception_b4_1x7_reduce_inception_b4_1x7_reduce_relu inception_b4_1x7_inception_b4_1x7_relu 0=192 1=7 11=1 4=3 14=0 5=1 6=258048 9=1
Convolution              inception_b4_7x1         1 1 inception_b4_1x7_inception_b4_1x7_relu inception_b4_7x1_inception_b4_7x1_relu 0=192 1=1 11=7 14=3 5=1 6=258048 9=1
Convolution              inception_b4_7x1_reduce  1 1 inception_b3_concat_splitncnn_1 inception_b4_7x1_reduce_inception_b4_7x1_reduce_relu 0=192 1=1 5=1 6=147456 9=1
Convolution              inception_b4_7x1_2       1 1 inception_b4_7x1_reduce_inception_b4_7x1_reduce_relu inception_b4_7x1_2_inception_b4_7x1_2_relu 0=192 1=1 11=7 14=3 5=1 6=258048 9=1
Convolution              inception_b4_1x7_2       1 1 inception_b4_7x1_2_inception_b4_7x1_2_relu inception_b4_1x7_2_inception_b4_1x7_2_relu 0=192 1=7 11=1 4=3 14=0 5=1 6=258048 9=1
Convolution              inception_b4_7x1_3       1 1 inception_b4_1x7_2_inception_b4_1x7_2_relu inception_b4_7x1_3_inception_b4_7x1_3_relu 0=192 1=1 11=7 14=3 5=1 6=258048 9=1
Convolution              inception_b4_1x7_3       1 1 inception_b4_7x1_3_inception_b4_7x1_3_relu inception_b4_1x7_3_inception_b4_1x7_3_relu 0=192 1=7 11=1 4=3 14=0 5=1 6=258048 9=1
Pooling                  inception_b4_pool_ave    1 1 inception_b3_concat_splitncnn_0 inception_b4_pool_ave 0=1 1=3 3=1
Convolution              inception_b4_1x1         1 1 inception_b4_pool_ave inception_b4_1x1_inception_b4_1x1_relu 0=192 1=1 5=1 6=147456 9=1
Concat                   inception_b4_concat      4 1 inception_b4_1x1_2_inception_b4_1x1_2_relu inception_b4_7x1_inception_b4_7x1_relu inception_b4_1x7_3_inception_b4_1x7_3_relu inception_b4_1x1_inception_b4_1x1_relu inception_b4_concat
Split                    splitncnn_8              1 3 inception_b4_concat inception_b4_concat_splitncnn_0 inception_b4_concat_splitncnn_1 inception_b4_concat_splitncnn_2
Convolution              reduction_b_3x3_reduce   1 1 inception_b4_concat_splitncnn_2 reduction_b_3x3_reduce_reduction_b_3x3_reduce_relu 0=192 1=1 5=1 6=147456 9=1
Convolution              reduction_b_3x3          1 1 reduction_b_3x3_reduce_reduction_b_3x3_reduce_relu reduction_b_3x3_reduction_b_3x3_relu 0=320 1=3 3=2 5=1 6=552960 9=1
Convolution              reduction_b_1x7_reduce   1 1 inception_b4_concat_splitncnn_1 reduction_b_1x7_reduce_reduction_b_1x7_reduce_relu 0=192 1=1 5=1 6=147456 9=1
Convolution              reduction_b_1x7          1 1 reduction_b_1x7_reduce_reduction_b_1x7_reduce_relu reduction_b_1x7_reduction_b_1x7_relu 0=192 1=7 11=1 4=3 14=0 5=1 6=258048 9=1
Convolution              reduction_b_7x1          1 1 reduction_b_1x7_reduction_b_1x7_relu reduction_b_7x1_reduction_b_7x1_relu 0=192 1=1 11=7 14=3 5=1 6=258048 9=1
Convolution              reduction_b_3x3_2        1 1 reduction_b_7x1_reduction_b_7x1_relu reduction_b_3x3_2_reduction_b_3x3_2_relu 0=192 1=3 3=2 5=1 6=331776 9=1
Pooling                  reduction_b_pool         1 1 inception_b4_concat_splitncnn_0 reduction_b_pool 1=3 2=2
Concat                   reduction_b_concat       3 1 reduction_b_3x3_reduction_b_3x3_relu reduction_b_3x3_2_reduction_b_3x3_2_relu reduction_b_pool reduction_b_concat
Split                    splitncnn_9              1 4 reduction_b_concat reduction_b_concat_splitncnn_0 reduction_b_concat_splitncnn_1 reduction_b_concat_splitncnn_2 reduction_b_concat_splitncnn_3
Convolution              inception_c1_1x1_2       1 1 reduction_b_concat_splitncnn_3 inception_c1_1x1_2_inception_c1_1x1_2_relu 0=320 1=1 5=1 6=409600 9=1
Convolution              inception_c1_1x3_reduce  1 1 reduction_b_concat_splitncnn_2 inception_c1_1x3_reduce_inception_c1_1x3_reduce_relu 0=384 1=1 5=1 6=491520 9=1
Split                    splitncnn_10             1 2 inception_c1_1x3_reduce_inception_c1_1x3_reduce_relu inception_c1_1x3_reduce_inception_c1_1x3_reduce_relu_splitncnn_0 inception_c1_1x3_reduce_inception_c1_1x3_reduce_relu_splitncnn_1
Convolution              inception_c1_1x3         1 1 inception_c1_1x3_reduce_inception_c1_1x3_reduce_relu_splitncnn_1 inception_c1_1x3_inception_c1_1x3_relu 0=384 1=3 11=1 4=1 14=0 5=1 6=442368 9=1
Convolution              inception_c1_3x1         1 1 inception_c1_1x3_reduce_inception_c1_1x3_reduce_relu_splitncnn_0 inception_c1_3x1_inception_c1_3x1_relu 0=384 1=1 11=3 14=1 5=1 6=442368 9=1
Convolution              inception_c1_3x3_reduce  1 1 reduction_b_concat_splitncnn_1 inception_c1_3x3_reduce_inception_c1_3x3_reduce_relu 0=448 1=1 5=1 6=573440 9=1
Convolution              inception_c1_3x3         1 1 inception_c1_3x3_reduce_inception_c1_3x3_reduce_relu inception_c1_3x3_inception_c1_3x3_relu 0=384 1=3 4=1 5=1 6=1548288 9=1
Split                    splitncnn_11             1 2 inception_c1_3x3_inception_c1_3x3_relu inception_c1_3x3_inception_c1_3x3_relu_splitncnn_0 inception_c1_3x3_inception_c1_3x3_relu_splitncnn_1
Convolution              inception_c1_1x3_2       1 1 inception_c1_3x3_inception_c1_3x3_relu_splitncnn_1 inception_c1_1x3_2_inception_c1_1x3_2_relu 0=384 1=3 11=1 4=1 14=0 5=1 6=442368 9=1
Convolution              inception_c1_3x1_2       1 1 inception_c1_3x3_inception_c1_3x3_relu_splitncnn_0 inception_c1_3x1_2_inception_c1_3x1_2_relu 0=384 1=1 11=3 14=1 5=1 6=442368 9=1
Pooling                  inception_c1_pool        1 1 reduction_b_concat_splitncnn_0 inception_c1_pool 0=1 1=3 3=1
Convolution              inception_c1_1x1         1 1 inception_c1_pool inception_c1_1x1_inception_c1_1x1_relu 0=192 1=1 5=1 6=245760 9=1
Concat                   inception_c1_concat      6 1 inception_c1_1x1_2_inception_c1_1x1_2_relu inception_c1_1x3_inception_c1_1x3_relu inception_c1_3x1_inception_c1_3x1_relu inception_c1_1x3_2_inception_c1_1x3_2_relu inception_c1_3x1_2_inception_c1_3x1_2_relu inception_c1_1x1_inception_c1_1x1_relu inception_c1_concat
Split                    splitncnn_12             1 4 inception_c1_concat inception_c1_concat_splitncnn_0 inception_c1_concat_splitncnn_1 inception_c1_concat_splitncnn_2 inception_c1_concat_splitncnn_3
Convolution              inception_c2_1x1_2       1 1 inception_c1_concat_splitncnn_3 inception_c2_1x1_2_inception_c2_1x1_2_relu 0=320 1=1 5=1 6=655360 9=1
Convolution              inception_c2_1x3_reduce  1 1 inception_c1_concat_splitncnn_2 inception_c2_1x3_reduce_inception_c2_1x3_reduce_relu 0=384 1=1 5=1 6=786432 9=1
Split                    splitncnn_13             1 2 inception_c2_1x3_reduce_inception_c2_1x3_reduce_relu inception_c2_1x3_reduce_inception_c2_1x3_reduce_relu_splitncnn_0 inception_c2_1x3_reduce_inception_c2_1x3_reduce_relu_splitncnn_1
Convolution              inception_c2_1x3         1 1 inception_c2_1x3_reduce_inception_c2_1x3_reduce_relu_splitncnn_1 inception_c2_1x3_inception_c2_1x3_relu 0=384 1=3 11=1 4=1 14=0 5=1 6=442368 9=1
Convolution              inception_c2_3x1         1 1 inception_c2_1x3_reduce_inception_c2_1x3_reduce_relu_splitncnn_0 inception_c2_3x1_inception_c2_3x1_relu 0=384 1=1 11=3 14=1 5=1 6=442368 9=1
Convolution              inception_c2_3x3_reduce  1 1 inception_c1_concat_splitncnn_1 inception_c2_3x3_reduce_inception_c2_3x3_reduce_relu 0=448 1=1 5=1 6=917504 9=1
Convolution              inception_c2_3x3         1 1 inception_c2_3x3_reduce_inception_c2_3x3_reduce_relu inception_c2_3x3_inception_c2_3x3_relu 0=384 1=3 4=1 5=1 6=1548288 9=1
Split                    splitncnn_14             1 2 inception_c2_3x3_inception_c2_3x3_relu inception_c2_3x3_inception_c2_3x3_relu_splitncnn_0 inception_c2_3x3_inception_c2_3x3_relu_splitncnn_1
Convolution              inception_c2_1x3_2       1 1 inception_c2_3x3_inception_c2_3x3_relu_splitncnn_1 inception_c2_1x3_2_inception_c2_1x3_2_relu 0=384 1=3 11=1 4=1 14=0 5=1 6=442368 9=1
Convolution              inception_c2_3x1_2       1 1 inception_c2_3x3_inception_c2_3x3_relu_splitncnn_0 inception_c2_3x1_2_inception_c2_3x1_2_relu 0=384 1=1 11=3 14=1 5=1 6=442368 9=1
Pooling                  inception_c2_pool        1 1 inception_c1_concat_splitncnn_0 inception_c2_pool 1=3 3=1
Convolution              inception_c2_1x1         1 1 inception_c2_pool inception_c2_1x1_inception_c2_1x1_relu 0=192 1=1 5=1 6=393216 9=1
Concat                   inception_c2_concat      6 1 inception_c2_1x1_2_inception_c2_1x1_2_relu inception_c2_1x3_inception_c2_1x3_relu inception_c2_3x1_inception_c2_3x1_relu inception_c2_1x3_2_inception_c2_1x3_2_relu inception_c2_3x1_2_inception_c2_3x1_2_relu inception_c2_1x1_inception_c2_1x1_relu inception_c2_concat
Pooling                  pool_8x8_s1              1 1 inception_c2_concat pool_8x8_s1_drop 0=1 4=1
InnerProduct             classifier               1 1 pool_8x8_s1_drop classifier 0=1000 1=1 2=2048000
Softmax                  prob                     1 1 classifier output
