7767517
3 4
Input                             data                        0 1 data 0=27 1=27 2=256
Split                             splitdata_2                 1 2 data data_slitdata_0 data_slitdata_1
Concat                            cc                          2 1 data_slitdata_0 data_slitdata_1 output
