7767517
2 2
Input                             data                        0 1 data 0=112 1=112 2=64
ConvolutionDepthWise              conv_dw1                    1 1 data output 0=64 1=3 2=1 3=2 4=1 5=1 6=36864 7=64