7767517
2 2
Input                             data                        0 1 data 0=112 1=112 2=32
ConvolutionDepthWise              conv_dw1                    1 1 data output 0=32 1=3 2=1 3=1 4=1 5=1 6=9216 7=32