7767517
2 2
Input                             data                        0 1 data 0=14 1=14 2=40
ConvolutionDepthWise              conv_dw1                    1 1 data output 0=40 1=5 2=1 3=1 4=2 5=1 6=40000 7=2