7767517
2 2
Input                             data                        0 1 data 0=40 1=40 2=64
DeconvolutionDepthWise            deconv_dw1                  1 1 data output 0=64 1=3 3=2 4=1 5=0 6=36864 7=2