7767517
2 2
Input                             data                        0 1 data 0=40 1=40 2=32
Deconvolution                     deconv1                     1 1 data output 0=32 1=3 3=1 4=1 5=1 6=9216