7767517
2 2
Input                             data                        0 1 data 0=40 1=40 2=64
DeconvolutionDepthWise            deconv_dw1                  1 1 data output 0=64 1=5 3=1 4=2 5=0 6=102400 7=64