7767517
2 2
Input                             data                        0 1 data 0=160 1=160 2=4
Deconvolution                     deconv1                     1 1 data output 0=64 1=2 3=2 5=1 6=1024