7767517
76 86
Input                    data                     0 1 data 0=224 1=224 2=3
Convolution              mobilenetv20_features_conv0_fwd 1 1 data mobilenetv20_features_relu60_relu6 0=8 1=3 3=2 4=1 5=1 6=216 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck0_conv0_fwd 1 1 mobilenetv20_features_relu60_relu6 mobilenetv20_features_linearbottleneck0_relu60_relu6 0=8 1=1 5=1 6=64 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck0_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck0_relu60_relu6 mobilenetv20_features_linearbottleneck0_relu61_relu6 0=8 1=3 4=1 5=1 6=72 7=8 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck0_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck0_relu61_relu6 mobilenetv20_features_linearbottleneck0_batchnorm2_fwd 0=4 1=1 5=1 6=32
Convolution              mobilenetv20_features_linearbottleneck1_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck0_batchnorm2_fwd mobilenetv20_features_linearbottleneck1_relu60_relu6 0=24 1=1 5=1 6=96 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck1_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck1_relu60_relu6 mobilenetv20_features_linearbottleneck1_relu61_relu6 0=24 1=3 3=2 4=1 5=1 6=216 7=24 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck1_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck1_relu61_relu6 mobilenetv20_features_linearbottleneck1_batchnorm2_fwd 0=6 1=1 5=1 6=144
Split                    splitncnn_0              1 2 mobilenetv20_features_linearbottleneck1_batchnorm2_fwd mobilenetv20_features_linearbottleneck1_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck1_batchnorm2_fwd_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck2_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck1_batchnorm2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck2_relu60_relu6 0=36 1=1 5=1 6=216 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck2_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck2_relu60_relu6 mobilenetv20_features_linearbottleneck2_relu61_relu6 0=36 1=3 4=1 5=1 6=324 7=36 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck2_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck2_relu61_relu6 mobilenetv20_features_linearbottleneck2_batchnorm2_fwd 0=6 1=1 5=1 6=216
BinaryOp                 mobilenetv20_features_linearbottleneck2_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck2_batchnorm2_fwd mobilenetv20_features_linearbottleneck1_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck2_elemwise_add0
Convolution              mobilenetv20_features_linearbottleneck3_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck2_elemwise_add0 mobilenetv20_features_linearbottleneck3_relu60_relu6 0=36 1=1 5=1 6=216 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck3_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck3_relu60_relu6 mobilenetv20_features_linearbottleneck3_relu61_relu6 0=36 1=3 3=2 4=1 5=1 6=324 7=36 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck3_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck3_relu61_relu6 mobilenetv20_features_linearbottleneck3_batchnorm2_fwd 0=8 1=1 5=1 6=288
Split                    splitncnn_1              1 2 mobilenetv20_features_linearbottleneck3_batchnorm2_fwd mobilenetv20_features_linearbottleneck3_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck3_batchnorm2_fwd_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck4_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck3_batchnorm2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck4_relu60_relu6 0=48 1=1 5=1 6=384 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck4_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck4_relu60_relu6 mobilenetv20_features_linearbottleneck4_relu61_relu6 0=48 1=3 4=1 5=1 6=432 7=48 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck4_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck4_relu61_relu6 mobilenetv20_features_linearbottleneck4_batchnorm2_fwd 0=8 1=1 5=1 6=384
BinaryOp                 mobilenetv20_features_linearbottleneck4_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck4_batchnorm2_fwd mobilenetv20_features_linearbottleneck3_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck4_elemwise_add0
Split                    splitncnn_2              1 2 mobilenetv20_features_linearbottleneck4_elemwise_add0 mobilenetv20_features_linearbottleneck4_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck4_elemwise_add0_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck5_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck4_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck5_relu60_relu6 0=48 1=1 5=1 6=384 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck5_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck5_relu60_relu6 mobilenetv20_features_linearbottleneck5_relu61_relu6 0=48 1=3 4=1 5=1 6=432 7=48 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck5_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck5_relu61_relu6 mobilenetv20_features_linearbottleneck5_batchnorm2_fwd 0=8 1=1 5=1 6=384
BinaryOp                 mobilenetv20_features_linearbottleneck5_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck5_batchnorm2_fwd mobilenetv20_features_linearbottleneck4_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck5_elemwise_add0
Convolution              mobilenetv20_features_linearbottleneck6_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck5_elemwise_add0 mobilenetv20_features_linearbottleneck6_relu60_relu6 0=48 1=1 5=1 6=384 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck6_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck6_relu60_relu6 mobilenetv20_features_linearbottleneck6_relu61_relu6 0=48 1=3 3=2 4=1 5=1 6=432 7=48 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck6_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck6_relu61_relu6 mobilenetv20_features_linearbottleneck6_batchnorm2_fwd 0=16 1=1 5=1 6=768
Split                    splitncnn_3              1 2 mobilenetv20_features_linearbottleneck6_batchnorm2_fwd mobilenetv20_features_linearbottleneck6_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck6_batchnorm2_fwd_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck7_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck6_batchnorm2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck7_relu60_relu6 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck7_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck7_relu60_relu6 mobilenetv20_features_linearbottleneck7_relu61_relu6 0=96 1=3 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck7_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck7_relu61_relu6 mobilenetv20_features_linearbottleneck7_batchnorm2_fwd 0=16 1=1 5=1 6=1536
BinaryOp                 mobilenetv20_features_linearbottleneck7_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck7_batchnorm2_fwd mobilenetv20_features_linearbottleneck6_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck7_elemwise_add0
Split                    splitncnn_4              1 2 mobilenetv20_features_linearbottleneck7_elemwise_add0 mobilenetv20_features_linearbottleneck7_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck7_elemwise_add0_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck8_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck7_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck8_relu60_relu6 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck8_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck8_relu60_relu6 mobilenetv20_features_linearbottleneck8_relu61_relu6 0=96 1=3 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck8_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck8_relu61_relu6 mobilenetv20_features_linearbottleneck8_batchnorm2_fwd 0=16 1=1 5=1 6=1536
BinaryOp                 mobilenetv20_features_linearbottleneck8_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck8_batchnorm2_fwd mobilenetv20_features_linearbottleneck7_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck8_elemwise_add0
Split                    splitncnn_5              1 2 mobilenetv20_features_linearbottleneck8_elemwise_add0 mobilenetv20_features_linearbottleneck8_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck8_elemwise_add0_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck9_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck8_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck9_relu60_relu6 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck9_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck9_relu60_relu6 mobilenetv20_features_linearbottleneck9_relu61_relu6 0=96 1=3 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck9_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck9_relu61_relu6 mobilenetv20_features_linearbottleneck9_batchnorm2_fwd 0=16 1=1 5=1 6=1536
BinaryOp                 mobilenetv20_features_linearbottleneck9_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck9_batchnorm2_fwd mobilenetv20_features_linearbottleneck8_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck9_elemwise_add0
Convolution              mobilenetv20_features_linearbottleneck10_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck9_elemwise_add0 mobilenetv20_features_linearbottleneck10_relu60_relu6 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck10_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck10_relu60_relu6 mobilenetv20_features_linearbottleneck10_relu61_relu6 0=96 1=3 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck10_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck10_relu61_relu6 mobilenetv20_features_linearbottleneck10_batchnorm2_fwd 0=24 1=1 5=1 6=2304
Split                    splitncnn_6              1 2 mobilenetv20_features_linearbottleneck10_batchnorm2_fwd mobilenetv20_features_linearbottleneck10_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck10_batchnorm2_fwd_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck11_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck10_batchnorm2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck11_relu60_relu6 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck11_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck11_relu60_relu6 mobilenetv20_features_linearbottleneck11_relu61_relu6 0=144 1=3 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck11_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck11_relu61_relu6 mobilenetv20_features_linearbottleneck11_batchnorm2_fwd 0=24 1=1 5=1 6=3456
BinaryOp                 mobilenetv20_features_linearbottleneck11_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck11_batchnorm2_fwd mobilenetv20_features_linearbottleneck10_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck11_elemwise_add0
Split                    splitncnn_7              1 2 mobilenetv20_features_linearbottleneck11_elemwise_add0 mobilenetv20_features_linearbottleneck11_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck11_elemwise_add0_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck12_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck11_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck12_relu60_relu6 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck12_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck12_relu60_relu6 mobilenetv20_features_linearbottleneck12_relu61_relu6 0=144 1=3 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck12_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck12_relu61_relu6 mobilenetv20_features_linearbottleneck12_batchnorm2_fwd 0=24 1=1 5=1 6=3456
BinaryOp                 mobilenetv20_features_linearbottleneck12_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck12_batchnorm2_fwd mobilenetv20_features_linearbottleneck11_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck12_elemwise_add0
Convolution              mobilenetv20_features_linearbottleneck13_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck12_elemwise_add0 mobilenetv20_features_linearbottleneck13_relu60_relu6 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck13_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck13_relu60_relu6 mobilenetv20_features_linearbottleneck13_relu61_relu6 0=144 1=3 3=2 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck13_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck13_relu61_relu6 mobilenetv20_features_linearbottleneck13_batchnorm2_fwd 0=40 1=1 5=1 6=5760
Split                    splitncnn_8              1 2 mobilenetv20_features_linearbottleneck13_batchnorm2_fwd mobilenetv20_features_linearbottleneck13_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck13_batchnorm2_fwd_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck14_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck13_batchnorm2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck14_relu60_relu6 0=240 1=1 5=1 6=9600 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck14_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck14_relu60_relu6 mobilenetv20_features_linearbottleneck14_relu61_relu6 0=240 1=3 4=1 5=1 6=2160 7=240 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck14_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck14_relu61_relu6 mobilenetv20_features_linearbottleneck14_batchnorm2_fwd 0=40 1=1 5=1 6=9600
BinaryOp                 mobilenetv20_features_linearbottleneck14_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck14_batchnorm2_fwd mobilenetv20_features_linearbottleneck13_batchnorm2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck14_elemwise_add0
Split                    splitncnn_9              1 2 mobilenetv20_features_linearbottleneck14_elemwise_add0 mobilenetv20_features_linearbottleneck14_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck14_elemwise_add0_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck15_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck14_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck15_relu60_relu6 0=240 1=1 5=1 6=9600 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck15_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck15_relu60_relu6 mobilenetv20_features_linearbottleneck15_relu61_relu6 0=240 1=3 4=1 5=1 6=2160 7=240 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck15_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck15_relu61_relu6 mobilenetv20_features_linearbottleneck15_batchnorm2_fwd 0=40 1=1 5=1 6=9600
BinaryOp                 mobilenetv20_features_linearbottleneck15_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck15_batchnorm2_fwd mobilenetv20_features_linearbottleneck14_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck15_elemwise_add0
Convolution              mobilenetv20_features_linearbottleneck16_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck15_elemwise_add0 mobilenetv20_features_linearbottleneck16_relu60_relu6 0=240 1=1 5=1 6=9600 9=3 -23310=2,0.000000,6.000000
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck16_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck16_relu60_relu6 mobilenetv20_features_linearbottleneck16_relu61_relu6 0=240 1=3 4=1 5=1 6=2160 7=240 9=3 -23310=2,0.000000,6.000000
Convolution              mobilenetv20_features_linearbottleneck16_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck16_relu61_relu6 mobilenetv20_features_linearbottleneck16_batchnorm2_fwd 0=80 1=1 5=1 6=19200
Convolution              mobilenetv20_features_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck16_batchnorm2_fwd mobilenetv20_features_relu61_relu6 0=1280 1=1 5=1 6=102400 9=3 -23310=2,0.000000,6.000000
Pooling                  mobilenetv20_features_pool0_fwd 1 1 mobilenetv20_features_relu61_relu6 mobilenetv20_features_pool0_fwd 0=1 1=1 4=1
InnerProduct             mobilenetv20_output_pred_fwd 1 1 mobilenetv20_features_pool0_fwd output 0=1000 2=1280000
